cask_args appdir: '/Applications'
tap 'caskroom/cask'

brew 'ack'
brew 'aspell'
brew 'autoenv'
brew 'autoconf'
brew 'base64'
brew 'bcrypt'
brew 'boost'
brew 'boot2docker'
brew 'burl'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'dict'
brew 'direnv'
brew 'docker'
brew 'dnscrypt-proxy'
brew 'findutils'
brew 'flyway'
brew 'gawk'
brew 'git'
brew 'git-extras'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'gpg'
brew 'hub'
brew 'jq'
brew 'node'
brew 'openvpn'
brew 'pandoc'
brew 'postgresql'
brew 'python3'
brew 'r'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'scala'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'tmux'
brew 'the_silver_searcher'
brew 'vim'
brew 'wemux'
brew 'wget'
brew 'zsh'

cask 'adoptopenjdk'
cask 'bartender'
cask 'bitcoin-core'
cask 'caffeine'
cask 'chromium'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'notion'
cask 'slack'
cask 'skype'
cask 'teamviewer'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmit'
cask 'transmission'
cask 'vagrant'
cask 'vlc'
cask 'xquartz'

