# Homebrew Bundle file
# Install with: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Core utilities
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "moreutils"

# Modern replacements for Unix tools
brew "bat"          # Better cat
brew "eza"          # Better ls
brew "fd"           # Better find  
brew "ripgrep"      # Better grep
brew "sd"           # Better sed
brew "dust"         # Better du
brew "procs"        # Better ps
brew "bottom"       # Better top
brew "zoxide"       # Better cd
brew "delta"        # Better diff

# Development tools
brew "git"
brew "git-delta"
brew "gh"           # GitHub CLI
brew "lazygit"
brew "neovim"
brew "tmux"
brew "direnv"
brew "just"
brew "watchman"

# Programming languages
brew "python@3.12"
brew "node"
brew "go"
brew "rust"

# Package managers
brew "pipx"
brew "yarn"
brew "pnpm"

# Terminal tools
brew "fzf"
brew "jq"
brew "yq"
brew "gum"          # Pretty terminal prompts
brew "starship"     # Cross-shell prompt

# Network tools
brew "curl"
brew "wget"
brew "httpie"
brew "mtr"
brew "nmap"

# Security
brew "gnupg"
brew "openssh"
brew "pass"

# Database tools
brew "postgresql@16"
brew "redis"
brew "sqlite"

# Cloud tools
brew "awscli"
brew "terraform"

# Containers
brew "docker"
brew "docker-compose"
brew "lazydocker"

# Utilities
brew "tree"
brew "htop"
brew "ncdu"
brew "tldr"
brew "pandoc"
brew "imagemagick"
brew "ffmpeg"

# Shell
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications (Casks)
cask "alacritty"
cask "arc"
cask "caffeine"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store apps (requires mas)
brew "mas"
# mas "1Password", id: 1333542190
# mas "Amphetamine", id: 937984704